{
  "item": [
    {
      "hed": "CRM",
      "id": "crm",
      "dek": "Customer relationship management (*CRM*) is a technology for managing all your organizations relationships and interactions with members/supporters and potential members and supporters. We integrate with these CRMs: NGPVAN/EveryAction, Action Network, MailChimp."
    },
    {
      "dek": "A content management system is a software application that can be used to manage the creation and modification of digital content. CMSs are typically used for enterprise content management and web content management. In our case we use Netlify as the CMS for Rising Campaigns sites. Other popular options are Kraft, WordPress and Drupal.",
      "id": "cms",
      "hed": "CMS"
    },
    {
      "dek": "The Domain Name System is a hierarchical and decentralized naming system for computers, services, or other resources connected to the Internet or a private network. It associates various information with domain names assigned to each of the participating entities. We will need access to this be able to pint your URL to our servers to produce and host your website.",
      "hed": "DNS",
      "id": "dns"
    },
    {
      "dek": "Search engine optimization is the process of growing the quality and quantity of website traffic by increasing the visibility of a website or a web page to users of a web search engine. SEO refers to the improvement of unpaid results and excludes direct traffic and the purchase of paid placement.",
      "hed": "SEO",
      "id": "seo"
    },
    {
      "dek": "A headless content management system, or headless CMS, is a back-end only content management system built from the ground up as a content repository that makes content accessible via a RESTful API for display on any device. The term “headless” comes from the concept of chopping the “head” off the “body”.",
      "hed": "Headless CMS",
      "id": "cms"
    },
    {
      "dek": "Hypertext Transfer Protocol Secure is an extension of the Hypertext Transfer Protocol. It is used for secure communication over a computer network, and is widely used on the Internet. In HTTPS, the communication protocol is encrypted using Transport Layer Security or, formerly, Secure Sockets Layer.",
      "hed": "HTTPS",
      "id": "https"
    },
    {
      "dek": "An Internet Protocol address is a numerical label assigned to each device connected to a computer network that uses the Internet Protocol for communication. An IP address serves two main functions: host or network interface identification and location addressing.",
      "hed": "IP Address",
      "id": "ip"
    },
    {
      "dek": "CDN- A content delivery network, or content distribution network, is a geographically distributed network of proxy servers and their data centers. The goal is to provide high availability and performance by distributing the service spatially relative to end users.",
      "hed": "CDN",
      "id": "cdn"
    },
    {
      "dek": "A Web cache is an information technology for the temporary storage of Web documents, such as Web pages, images, and other types of Web multimedia, to reduce server lag. A Web cache system stores copies of documents passing through it; subsequent requests may be satisfied from the cache if certain conditions are met.",
      "hed": "Browser Cache",
      "id": "cache"
    },
    {
      "dek": "Bad Request: The 400 is a generic error you get when the server can’t understand the request from the browser, either because it was not sent correctly or because it was corrupted along the way. A 400 error can be due to a number of factors, including a bad internet connection, a caching issue, or a browser malfunction. Check your connection and settings, clear your cache, open a different browser, and retry.",
      "hed": "Error 400",
      "id": "error"
    },
    {
      "dek": "Authorization Required: The 401 error occurs when you try to access a web page that requires a password. There’s no workaround for this one other than obtaining a password through the proper channels.",
      "hed": "Error 401",
      "id": "error"
    },
    {
      "dek": "Forbidden: When you try to load a web page you don’t have permission to access, you’ll get a 403 error. Usually, getting this error means you have entered a URL or clicked a link that goes to a page that has been set up with access permissions, meaning you have to have an account or some other type of authorization in order to access the page. Try going to the website’s home page and getting to your desired location from there, checking to see if an account signup is an option.",
      "hed": "Error 403",
      "id": "error"
    },
    {
      "dek": "Not Found: A 404 error indicates that the server can't find the page you’re looking for. With this error, chances are the URL has been entered incorrectly, so double-check the spelling, punctuation and suffix (.com, .net, .org, etc.) of the domain name and try again.",
      "hed": "Error 404",
      "id": "error"
    },
    {
      "dek": "\nMethod Not Allowed: The 405 error is less common and less easily defined than some others. Basically, a 405 error means that the server understands what the web browser is asking for, but is refusing to fulfill the request. A 405 error could be the result of an error in the website’s code or a faulty redirect.\n",
      "hed": "Error 405",
      "id": "error"
    },
    {
      "dek": "Internal Server Error: The 500 is the most common server error, and like the 400 it’s a generic code that points to an unspecified problem. Whenever a server encounters a difficulty that prevents it from fulfilling a request and the issue is not one described by the other available server codes, the server generates a 500 error. Try reloading the page, clearing the cache, deleting cookies and restarting the browser.",
      "hed": "Error 500",
      "id": "error"
    },
    {
      "dek": "Service Unavailable: A 503 error indicates that the web server is unable to process the request. When you get a 503 error, it could mean the server is undergoing maintenance, or is overloaded with requests. The best approach with the 503 error is to try again later.",
      "id": "error",
      "hed": "Error 503"
    }
  ],
  "hed": "Glossary of Terms"
}